DataProcessors/УДАЛИТЬ_МониторыРуководителя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>УДАЛИТЬ_МониторыРуководителя</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоВЕдиницахДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.Замена</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УДАЛИТЬ_ЗаказНаПроизводство</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентами</Name>
			<Comment>Взаиморасчеты с контрагентами</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УДАЛИТЬ_Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТовараПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаБанковскойКартой</v8:Type>
						<v8:Type>cfg:DocumentRef.Замена</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТовараОтПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ДвиженияДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ДвиженияДенежныхСредств</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПриход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРасход</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/МинимальныеОстаткиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>МинимальныеОстаткиНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоМаксимум</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/УДАЛИТЬ_МониторыРуководителя/Forms/МониторРуководителяОпт/Ext/Form/Module.bsl
&НаСервере
Функция ПолучитьОтчетПоДенежнымСредствам()
	
	ЭтаОбработка = РеквизитФормыВЗначение("Объект");
	Макет = ЭтаОбработка.ПолучитьМакет("ВедомостьДвиженияДенежныхСредств");
	Таб = Новый ТабличныйДокумент;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	Таб.Вывести(ОбластьМакета);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДенежныеСредстваОстаткиИОбороты.Организация КАК Организация,
	|	ДенежныеСредстваОстаткиИОбороты.СчетКасса КАК СчетКасса,
	|	ДенежныеСредстваОстаткиИОбороты.СуммаНачальныйОстаток КАК СуммаНачальныйОстаток,
	|	ДенежныеСредстваОстаткиИОбороты.СуммаПриход КАК СуммаПриход,
	|	ДенежныеСредстваОстаткиИОбороты.СуммаРасход КАК СуммаРасход,
	|	ДенежныеСредстваОстаткиИОбороты.СуммаКонечныйОстаток КАК СуммаКонечныйОстаток,
	|	ДенежныеСредстваОстаткиИОбороты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.ОстаткиИОбороты(&ДатаНачало, &ДатаКонец, Регистратор, , ) КАК ДенежныеСредстваОстаткиИОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	СчетКасса,
	|	Регистратор
	|ИТОГИ
	|	СУММА(СуммаНачальныйОстаток),
	|	СУММА(СуммаПриход),
	|	СУММА(СуммаРасход),
	|	СУММА(СуммаКонечныйОстаток)
	|ПО
	|	Организация,
	|	СчетКасса,
	|	Регистратор
	|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("ДатаНачало",НачалоДня(Период.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаКонец",КонецДня(Период.ДатаОкончания));
	
	Таб.НачатьАвтогруппировкуСтрок();
	ВыборкаОрганизации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОрганизации.Следующий() Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("Организация");
		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаОрганизации);
		Таб.Вывести(ОбластьМакета,1,"Организации");
		ВыбркаКассы = ВыборкаОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыбркаКассы.Следующий() Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Касса");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыбркаКассы);
			Таб.Вывести(ОбластьМакета,2,"Кассы",Истина);
			ВыборкаРегистраторы = ВыбркаКассы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаРегистраторы.Следующий() Цикл
				ОбластьМакета = Макет.ПолучитьОбласть("Регистратор");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаРегистраторы);
				Таб.Вывести(ОбластьМакета,3,"Регистраторы",Ложь);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	Таб.ЗакончитьАвтогруппировкуСтрок();
	
	Возврат Таб;
	
КонецФункции

&НаСервере
Функция ПолучитьОтчетСебестоимостьСклада()
	
	ЭтаОбработка = РеквизитФормыВЗначение("Объект");
	Макет = ЭтаОбработка.ПолучитьМакет("СебестоимостьСклада");
	Таб = Новый ТабличныйДокумент;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	Таб.Вывести(ОбластьМакета);
	
	//#6775 закомментировано
	//СписокВидовПотолки = Новый СписокЗначений;
	//СписокВидовПотолки.Добавить(Справочники.ВидыНоменклатуры.Потолок);
	//СписокВидовПотолки.Добавить(Справочники.ВидыНоменклатуры.Отрез);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыНаСкладахОстатки.Организация КАК Организация,
	|	ТоварыНаСкладахОстатки.Склад КАК Склад,
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ТоварыНаСкладахОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ВЫБОР
	|		КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ТоварыНаСкладахОстатки.СуммаОстаток / ТоварыНаСкладахОстатки.КоличествоОстаток КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СредняяЦена
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			&ДатаОкончания,
	|			ВЫБОР
	|					КОГДА &ОтборПоНоменклатуре
	|						ТОГДА Номенклатура В ИЕРАРХИИ (&МассивНоменклатуры)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И ВЫБОР
	|					КОГДА &ОтборПоСкладам
	|						ТОГДА Склад В ИЕРАРХИИ (&МассивСкладов)
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ТоварыНаСкладахОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТоварыНаСкладахОстатки.Склад.Наименование,
	|	ТоварыНаСкладахОстатки.Номенклатура.ЭтоГруппа УБЫВ,
	|	ТоварыНаСкладахОстатки.Номенклатура.Наименование
	|ИТОГИ
	|	СУММА(КоличествоОстаток),
	|	СУММА(СуммаОстаток),
	|	СУММА(СредняяЦена)
	|ПО
	|	Организация,
	|	Склад,
	|	Номенклатура ИЕРАРХИЯ";
	Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(Период.ДатаОкончания));
	//Запрос.УстановитьПараметр("ВидНоменклатуры",СписокВидовПотолки); //#6775 закомментировано

	МассивНоменклатуры = Новый Массив;
	МассивСкладов      = Новый Массив; //#6775
	Если НЕ НастройкаМонитора.Пустая() Тогда
		МассивНоменклатуры = НастройкаМонитора.НоменклатураДляОтбораПоОтчетуСебестоимостьСклада.ВыгрузитьКолонку("Номенклатура"); 
		МассивСкладов = НастройкаМонитора.СкладыДляОтбораПоОтчетуСебестоимостьСклада.ВыгрузитьКолонку("Склад");
	КонецЕсли;
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	Запрос.УстановитьПараметр("ОтборПоНоменклатуре", МассивНоменклатуры.Количество() > 0);
	Запрос.УстановитьПараметр("МассивСкладов", МассивСкладов);
	Запрос.УстановитьПараметр("ОтборПоСкладам", МассивСкладов.Количество() > 0);
	
	Таб.НачатьАвтогруппировкуСтрок();
	ВыборкаОрганизации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОрганизации.Следующий() Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("Организация");
		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаОрганизации);
		Таб.Вывести(ОбластьМакета,1,"Организации");
		ВыборкаСклады = ВыборкаОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСклады.Следующий() Цикл
			ОбластьМакета = Макет.ПолучитьОбласть("Склад");
			ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаСклады);
			Таб.Вывести(ОбластьМакета,2,"Склады",Истина);
			ОбходНоменклатура = ВыборкаСклады.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ОбходНоменклатура.Следующий() Цикл
				Если ОбходНоменклатура.Номенклатура.ЭтоГруппа Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("Группа");
					ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ОбходНоменклатура);
					Таб.Вывести(ОбластьМакета,3+ОбходНоменклатура.Номенклатура.Уровень(),"Номенклатура"+ОбходНоменклатура.Номенклатура.Уровень(),Ложь);
				Иначе
					ОбластьМакета = Макет.ПолучитьОбласть("Номенклатура");
					ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ОбходНоменклатура);
					Таб.Вывести(ОбластьМакета,3+ОбходНоменклатура.Номенклатура.Уровень(),"Номенклатура"+ОбходНоменклатура.Номенклатура.Уровень(),Ложь);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	Таб.ЗакончитьАвтогруппировкуСтрок();
	
	Возврат Таб;
	
КонецФункции

&НаСервере
Функция ПолучитьОтчетПоПродажам()
	
	ЭтаОбработка = РеквизитФормыВЗначение("Объект");
	Макет = ЭтаОбработка.ПолучитьМакет("Продажи");
	Таб = Новый ТабличныйДокумент;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	Таб.Вывести(ОбластьМакета);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПродажиОбороты.Организация КАК Организация,
	|	ПродажиОбороты.Номенклатура КАК Номенклатура,
	|	ПродажиОбороты.КоличествоОборот КАК КоличествоОборот,
	|	ПродажиОбороты.СуммаОборот КАК СуммаОборот,
	|	ВЫБОР
	|		КОГДА ПродажиОбороты.КоличествоОборот = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ПродажиОбороты.СуммаОборот / ПродажиОбороты.КоличествоОборот КАК ЧИСЛО(15, 2))
	|	КОНЕЦ КАК СредняяЦена
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, , &УСЛОВИЕ_ПО_НОМЕНКЛАТУРЕ) КАК ПродажиОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПродажиОбороты.Номенклатура.ЭтоГруппа УБЫВ,
	|	ПродажиОбороты.Номенклатура.Наименование
	|ИТОГИ
	|	СУММА(КоличествоОборот),
	|	СУММА(СуммаОборот),
	|	СУММА(СредняяЦена)
	|ПО
	|	Организация,
	|	Номенклатура ИЕРАРХИЯ";
	Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(Период.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(Период.ДатаОкончания));
	
	Если НЕ НастройкаМонитора.Пустая() Тогда
		Если НастройкаМонитора.НоменклатураДляОтбораПоОтчетуОбъемПродаж.Количество() > 0 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УСЛОВИЕ_ПО_НОМЕНКЛАТУРЕ","Номенклатура В ИЕРАРХИИ (&СписокЗначений)");
			Запрос.УстановитьПараметр("СписокЗначений",НастройкаМонитора.НоменклатураДляОтбораПоОтчетуОбъемПродаж.ВыгрузитьКолонку("Номенклатура"));
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УСЛОВИЕ_ПО_НОМЕНКЛАТУРЕ","");
		КонецЕсли;
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УСЛОВИЕ_ПО_НОМЕНКЛАТУРЕ","");
	КонецЕсли;

	
	Таб.НачатьАвтогруппировкуСтрок();
	ВыборкаОрганизации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОрганизации.Следующий() Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("Организация");
		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаОрганизации);
		Таб.Вывести(ОбластьМакета,1,"Организации");
		ВыбркаНоменклатура = ВыборкаОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыбркаНоменклатура.Следующий() Цикл
			Если ВыбркаНоменклатура.Номенклатура.ЭтоГруппа Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Группа");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыбркаНоменклатура);
				Таб.Вывести(ОбластьМакета,2+ВыбркаНоменклатура.Номенклатура.Уровень(),"Номенклатура"+ВыбркаНоменклатура.Номенклатура.Уровень(),Ложь);
			Иначе
				ОбластьМакета = Макет.ПолучитьОбласть("Номенклатура");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыбркаНоменклатура);
				Таб.Вывести(ОбластьМакета,2+ВыбркаНоменклатура.Номенклатура.Уровень(),"Номенклатура"+ВыбркаНоменклатура.Номенклатура.Уровень(),Ложь);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Таб.ЗакончитьАвтогруппировкуСтрок();
	
	Возврат Таб;
	
КонецФункции

&НаСервере
Функция ПолучитьОтчетДолгиКонтрагентов()
	
	ЭтаОбработка = РеквизитФормыВЗначение("Объект");
	Макет = ЭтаОбработка.ПолучитьМакет("ДолгиКонтрагентов");
	Таб = Новый ТабличныйДокумент;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	Таб.Вывести(ОбластьМакета);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыСКонтрагентамиОстатки.Организация КАК Организация,
	|	ВзаиморасчетыСКонтрагентамиОстатки.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток > 0
	|			ТОГДА ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ДолгКонтрагента,
	|	ВЫБОР
	|		КОГДА ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток < 0
	|			ТОГДА ВзаиморасчетыСКонтрагентамиОстатки.СуммаОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НашДолг
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКонтрагентами.Остатки(&ДатаОкончания, &УСЛОВИЕ_ПО_КОНТРАГЕНТАМ) КАК ВзаиморасчетыСКонтрагентамиОстатки
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВзаиморасчетыСКонтрагентамиОстатки.Контрагент.ЭтоГруппа УБЫВ,
	|	ВзаиморасчетыСКонтрагентамиОстатки.Контрагент.Наименование
	|ИТОГИ
	|	СУММА(ДолгКонтрагента),
	|	СУММА(НашДолг)
	|ПО
	|	Организация,
	|	Контрагент ИЕРАРХИЯ";
	Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(Период.ДатаОкончания));
	
	Если НЕ НастройкаМонитора.Пустая() Тогда
		Если НастройкаМонитора.КонтрагентыДляОтбораПоОтчетуДолгиКонтрагентов.Количество() > 0 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УСЛОВИЕ_ПО_КОНТРАГЕНТАМ","Контрагент В ИЕРАРХИИ (&СписокЗначений)");
			Запрос.УстановитьПараметр("СписокЗначений",НастройкаМонитора.КонтрагентыДляОтбораПоОтчетуДолгиКонтрагентов.ВыгрузитьКолонку("Контрагент"));
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УСЛОВИЕ_ПО_КОНТРАГЕНТАМ","");
		КонецЕсли;
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УСЛОВИЕ_ПО_КОНТРАГЕНТАМ","");
	КонецЕсли;

	
	Таб.НачатьАвтогруппировкуСтрок();
	ВыборкаОрганизации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОрганизации.Следующий() Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("Организация");
		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаОрганизации);
		Таб.Вывести(ОбластьМакета,1,"Организации");
		ВыборкаКонтрагент = ВыборкаОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаКонтрагент.Следующий() Цикл
			Попытка
				Если ВыборкаКонтрагент.Контрагент.ЭтоГруппа Тогда
					ОбластьМакета = Макет.ПолучитьОбласть("КонтрагентГруппа");
					ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаКонтрагент);
					Таб.Вывести(ОбластьМакета,1+ВыборкаКонтрагент.Контрагент.Уровень(),"Контрагент"+ВыборкаКонтрагент.Контрагент.Уровень(),Ложь);
				Иначе
					ОбластьМакета = Макет.ПолучитьОбласть("Контрагент");
					ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаКонтрагент);
					Таб.Вывести(ОбластьМакета,1+ВыборкаКонтрагент.Контрагент.Уровень(),"Контрагент"+ВыборкаКонтрагент.Контрагент.Уровень(),Ложь);
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецЦикла;
	КонецЦикла;
	Таб.ЗакончитьАвтогруппировкуСтрок();
	
	Возврат Таб;
	
КонецФункции

&НаСервере
Функция ПолучитьОтчетАнализДвиженияДенежныхСредств()
	
	ЭтаОбработка = РеквизитФормыВЗначение("Объект");
	Макет = ЭтаОбработка.ПолучитьМакет("АнализДвиженияДенежныхСредств");
	Таб = Новый ТабличныйДокумент;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	Таб.Вывести(ОбластьМакета);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДвиженияДенежныхСредствОбороты.Статья,
	|	ДвиженияДенежныхСредствОбороты.СуммаПриходОборот,
	|	ДвиженияДенежныхСредствОбороты.СуммаРасходОборот
	|ИЗ
	|	РегистрНакопления.ДвиженияДенежныхСредств.Обороты(&ДатаНачала, &ДатаОкончания, , ) КАК ДвиженияДенежныхСредствОбороты
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДвиженияДенежныхСредствОбороты.Статья.Наименование";
	Запрос.УстановитьПараметр("ДатаНачала",НачалоДня(Период.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(Период.ДатаОкончания));
	
	ВыборкаСтатьи = Запрос.Выполнить().Выбрать();
	Пока ВыборкаСтатьи.Следующий() Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("Статья");
		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаСтатьи);
		Таб.Вывести(ОбластьМакета);
	КонецЦикла;
	
	Возврат Таб;
	
КонецФункции

&НаСервере
Функция ПолучитьОтчетКонтрольМинимальныхОстатков()
	
	ЭтаОбработка = РеквизитФормыВЗначение("Объект");
	Макет = ЭтаОбработка.ПолучитьМакет("КонтрольМинимальныхОстатков");
	Таб = Новый ТабличныйДокумент;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	Таб.Вывести(ОбластьМакета);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МинимальныеОстаткиНоменклатурыСрезПоследних.Склад КАК Склад,
	|	МинимальныеОстаткиНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	МинимальныеОстаткиНоменклатурыСрезПоследних.Количество КАК МинимальноеКоличество,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК ОстатокКоличество,
	|	ВЫБОР
	|		КОГДА МинимальныеОстаткиНоменклатурыСрезПоследних.Количество >= ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Внимание,
	|	МинимальныеОстаткиНоменклатурыСрезПоследних.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.МинимальныеОстаткиНоменклатуры.СрезПоследних КАК МинимальныеОстаткиНоменклатурыСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	|		ПО МинимальныеОстаткиНоменклатурыСрезПоследних.Склад = ТоварыНаСкладахОстатки.Склад
	|			И МинимальныеОстаткиНоменклатурыСрезПоследних.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|ГДЕ
	|	МинимальныеОстаткиНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяССылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МинимальныеОстаткиНоменклатурыСрезПоследних.Склад,
	|	МинимальныеОстаткиНоменклатурыСрезПоследних.Номенклатура,
	|	МинимальныеОстаткиНоменклатурыСрезПоследних.Количество,
	|	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0),
	|	ВЫБОР
	|		КОГДА МинимальныеОстаткиНоменклатурыСрезПоследних.Количество >= ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ,
	|	МинимальныеОстаткиНоменклатурыСрезПоследних.Регистратор
	|ИЗ
	|	РегистрСведений.МинимальныеОстаткиНоменклатуры.СрезПоследних КАК МинимальныеОстаткиНоменклатурыСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	|		ПО МинимальныеОстаткиНоменклатурыСрезПоследних.Склад = ТоварыНаСкладахОстатки.Склад
	|			И МинимальныеОстаткиНоменклатурыСрезПоследних.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	|			И МинимальныеОстаткиНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
	|ГДЕ
	|	НЕ МинимальныеОстаткиНоменклатурыСрезПоследних.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяССылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Склад,
	|	Номенклатура
	|ИТОГИ
	|	СУММА(МинимальноеКоличество),
	|	СУММА(ОстатокКоличество),
	|	СУММА(Внимание)
	|ПО
	|	Склад,
	|	Номенклатура";
	Запрос.УстановитьПараметр("ДатаКонтроля",КонецДня(ТекущаяДатаСеанса()));
	
	Таб.НачатьАвтогруппировкуСтрок();
	ВыборкаСклады = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСклады.Следующий() Цикл
		Если ВыборкаСклады.Внимание > 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Склад");
		ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыборкаСклады);
		Таб.Вывести(ОбластьМакета,1,"Склады",Истина);
		ВыбркаНоменклатура = ВыборкаСклады.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыбркаНоменклатура.Следующий() Цикл
			Если ВыбркаНоменклатура.Внимание > 0 Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Номенклатура");
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ВыбркаНоменклатура);
				Таб.Вывести(ОбластьМакета,2,"Номенклатура",Истина);
			КонецЕсли;
		КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Таб.ЗакончитьАвтогруппировкуСтрок();
	
	Возврат Таб;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьДанные()
	Если Элементы.ВедомостьДвиженияДенежныхСредств.Видимость Тогда
		ВедомостьДвиженияДенежныхСредств = ПолучитьОтчетПоДенежнымСредствам();
	КонецЕсли;
	Если Элементы.СебестоимостьСклада.Видимость Тогда
		СебестоимостьСклада = ПолучитьОтчетСебестоимостьСклада();
	КонецЕсли;
	Если Элементы.Продажи.Видимость Тогда
		Продажи = ПолучитьОтчетПоПродажам();
	КонецЕсли;
	Если Элементы.ДолгиКонтрагентов.Видимость Тогда
		ДолгиКонтрагентов = ПолучитьОтчетДолгиКонтрагентов();
	КонецЕсли;
	Если Элементы.АнализДвиженияДенежныхСредств.Видимость Тогда
		АнализДвиженияДенежныхСредств = ПолучитьОтчетАнализДвиженияДенежныхСредств();
	КонецЕсли;
	Если Элементы.КонтрольМинимальныхОстатков.Видимость Тогда
		КонтрольМинимальныхОстатков = ПолучитьОтчетКонтрольМинимальныхОстатков();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Период.ДатаНачала = НачалоМесяца(ТекущаяДата());
	Период.ДатаОкончания = КонецМесяца(ТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ОбновитьДанные();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьДанные();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ПараметрыСеанса.ТекущийПользователь.ДоступенМониторРуководителяОпт Тогда
		Элементы.ГруппаНастройки.Видимость = Ложь;
		Элементы.ВедомостьДвиженияДенежныхСредств.Видимость = Ложь;
		Элементы.СебестоимостьСклада.Видимость = Ложь;
		Элементы.Продажи.Видимость = Ложь;
		Элементы.ДолгиКонтрагентов.Видимость = Ложь;
		Элементы.АнализДвиженияДенежныхСредств.Видимость = Ложь;
		Элементы.КонтрольМинимальныхОстатков.Видимость = Ложь;
		
		Элементы.ДекорацияВедомостьДвиженияДенежныхСредств.Видимость = Ложь;
		Элементы.ДекорацияСебестоимостьСклада.Видимость = Ложь;
		Элементы.ДекорацияПродажи.Видимость = Ложь;
		Элементы.ДекорацияДолгиКонтрагентов.Видимость = Ложь;
		Элементы.ДекорацияАнализДвиженияДенежныхСредств.Видимость = Ложь;
		Элементы.ДекорацияКонтрольМинимальныхОстатков.Видимость = Ложь;
		
		ЭтаФорма.АвтоЗаголовок = Ложь;
		ЭтаФорма.Заголовок = "";
	Иначе
		НастройкаМонитора = ПараметрыСеанса.ТекущийПользователь.ИспользуемаяНастройкаМонитораОпт;
		Если НастройкаМонитора.Пустая() Тогда
			НастройкаМонитора = Справочники.УДАЛИТЬ_НастройкиМонитораОпт.НастройкаПоУмолчанию;
		КонецЕсли;
		Элементы.ВедомостьДвиженияДенежныхСредств.Видимость = НастройкаМонитора.ПоказыватьВедомостьДвиженияДенежныхСредств;
		Элементы.СебестоимостьСклада.Видимость = НастройкаМонитора.ПоказыватьСебестоимостьСклада;
		Элементы.Продажи.Видимость = НастройкаМонитора.ПоказыватьПродажи;
		Элементы.ДолгиКонтрагентов.Видимость = НастройкаМонитора.ПоказыватьДолгиКонтрагентов;
		Элементы.АнализДвиженияДенежныхСредств.Видимость = НастройкаМонитора.ПоказыватьАнализДвиженияДенежныхСредств;
		Элементы.КонтрольМинимальныхОстатков.Видимость = НастройкаМонитора.ПоказыватьМинимальныеОстатки;
		
		Элементы.ДекорацияВедомостьДвиженияДенежныхСредств.Видимость = НастройкаМонитора.ПоказыватьВедомостьДвиженияДенежныхСредств;
		Элементы.ДекорацияСебестоимостьСклада.Видимость = НастройкаМонитора.ПоказыватьСебестоимостьСклада;
		Элементы.ДекорацияПродажи.Видимость = НастройкаМонитора.ПоказыватьПродажи;
		Элементы.ДекорацияДолгиКонтрагентов.Видимость = НастройкаМонитора.ПоказыватьДолгиКонтрагентов;
		Элементы.ДекорацияАнализДвиженияДенежныхСредств.Видимость = НастройкаМонитора.ПоказыватьАнализДвиженияДенежныхСредств;
		Элементы.ДекорацияКонтрольМинимальныхОстатков.Видимость = НастройкаМонитора.ПоказыватьМинимальныеОстатки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияВедомостьДвиженияДенежныхСредствНажатие(Элемент)
	ОткрытьФорму("Отчет.ВедомостьДвиженияДенежныхСредств.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСебестоимостьСкладаНажатие(Элемент)
	ОткрытьФорму("Отчет.ВедомостьПоТоварамНаСкладах.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПродажиНажатие(Элемент)
	ОткрытьФорму("Отчет.Продажи.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияДолгиКонтрагентовНажатие(Элемент)
	ОткрытьФорму("Отчет.ВедомостьПоВзаиморасчетамСКонтрагентами.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияАнализДвиженияДенежныхСредствНажатие(Элемент)
	ОткрытьФорму("Отчет.АнализДвиженияДенежныхСредств.Форма");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКонтрольМинимальныхОстатковНажатие(Элемент)
	ОткрытьФорму("Отчет.КонтрольМинимальныхОстатков.Форма");
КонецПроцедуры
